package COCI06.contest4

/**
 * ### 문제 설명
 * - 완전 이진 트리는 계층적인 구조로 이루어져 있다.
 * -           0
 * -      1         1
 * -   2     2   2     2
 * - 위 모양의 형태로 루트는 0레벨, 그 자식은 1레벨, 그의 자식은 2레벨이다.
 * - 보통 레벨이 N인 완전 이진 트리는 2^n - 1개의 노드를 갖고 있다.
 * - 레벨이 N-1(루트) 노드는 자식 노드를 2개씩 갖고 있다.
 * - 레벨이 D인 각각의 노드에 대해, 왼쪽 서브트리에 쓰여있는 숫자의 합과
 * - 오른쪽 서브 트리에 쓰여있는 숫자의 합의 차이는 2^d라는 조건을 만족해야 한다.
 *
 * ### 예제1
 * -           3
 * -      1         2
 *
 * ### 예제2
 * -           3
 * -      1         6
 * -   7     5   2     4
 * */

fun main() = with(System.`in`.bufferedReader()) {

}